tap "derailed/k9s"
tap "fluxcd/tap"
tap "hashicorp/tap"
tap "siderolabs/tap"
brew "openssl@3"
brew "tree"
brew "ansible"
brew "ansible-lint"
brew "argocd"
brew "chafa"
brew "chezmoi"
brew "cloudflared"
brew "cosign"
brew "dnsmasq"
brew "eza"
brew "fzf"
brew "gh"
brew "git"
brew "grpcurl"
brew "jq"
brew "kind"
brew "kustomize"
brew "lazygit"
brew "mise"
brew "mkcert"
brew "neovim"
brew "pkgconf"
brew "protobuf"
brew "ripgrep"
brew "rustup"
brew "sheldon"
brew "starship"
brew "tenv"
brew "terraform", link: false
brew "tfenv"
brew "tmux"
brew "uv"
brew "yamllint"
brew "yq"
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "derailed/k9s/k9s"
brew "fluxcd/tap/flux"
brew "hashicorp/tap/vault"
brew "siderolabs/tap/talosctl"
cask "font-hackgen-nerd"
cask "ghostty"
cask "orbstack"
cask "temurin@17"
cask "temurin@21"
vscode "4ops.terraform"
vscode "anthropic.claude-code"
vscode "bradlc.vscode-tailwindcss"
vscode "dbaeumer.vscode-eslint"
vscode "docker.docker"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "enkia.tokyo-night"
vscode "esbenp.prettier-vscode"
vscode "golang.go"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-ceintl.vscode-language-pack-ja"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-containers"
vscode "oderwat.indent-rainbow"
vscode "pkief.material-icon-theme"
vscode "prisma.prisma"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.liveserver"
vscode "rust-lang.rust-analyzer"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "yzane.markdown-pdf"
go "github.com/onsi/ginkgo/v2/ginkgo"
go "golang.org/x/tools/gopls"
go "github.com/sqldef/sqldef/cmd/mysqldef"
go "github.com/prometheus/promu"
go "google.golang.org/protobuf/cmd/protoc-gen-go"
go "google.golang.org/grpc/cmd/protoc-gen-go-grpc"
go "honnef.co/go/tools/cmd/staticcheck"
go "github.com/swaggo/swag/cmd/swag"
